zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32l1xx/drivers/include/stm32l1xx_ll_adc.h
/* Note: Only ADC IP HW delays are defined in ADC LL driver driver,           */
/*       not timeout values.                                                  */
/*       Timeout values for ADC operations are dependent to device clock      */
/*       configuration (system clock versus ADC clock),                       */
/*       and therefore must be defined in user application.                   */
/*       Indications for estimation of ADC timeout delays, for this           */
/*       STM32 serie:                                                         */
/*       - ADC enable time: maximum delay is 3.5us                            */
/*         (refer to device datasheet, parameter "tSTAB")                     */
/*       - ADC conversion time: duration depending on ADC clock and ADC       */
/*         configuration.                                                     */
/*         (refer to device reference manual, section "Timing")               */

/* Delay for internal voltage reference stabilization time.                   */
/* Delay set to maximum value (refer to device datasheet,                     */
/* parameter "TADC_BUF").                                                     */
/* Unit: us                                                                   */
#define LL_ADC_DELAY_VREFINT_STAB_US       (  10U)  /*!< Delay for internal voltage reference stabilization time */

/* Delay for temperature sensor stabilization time.                           */
/* Literal set to maximum value (refer to device datasheet,                   */
/* parameter "tSTART").                                                       */
/* Unit: us                                                                   */
#define LL_ADC_DELAY_TEMPSENSOR_STAB_US    (  10U)  /*!< Delay for internal voltage reference stabilization time */

/**
  * @}
  */

/**
  * @}
  */


/* Exported macro ------------------------------------------------------------*/
/** @defgroup ADC_LL_Exported_Macros ADC Exported Macros
  * @{
  */

/** @defgroup ADC_LL_EM_WRITE_READ Common write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in ADC register
  * @param  __INSTANCE__ ADC Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_ADC_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG(__INSTANCE__->__REG__, (__VALUE__))

/**
  * @brief  Read a value in ADC register
  * @param  __INSTANCE__ ADC Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_ADC_ReadReg(__INSTANCE__, __REG__) READ_REG(__INSTANCE__->__REG__)
/**
  * @}
  */

/** @defgroup ADC_LL_EM_HELPER_MACRO ADC helper macro
  * @{
  */

/**
  * @brief  Helper macro to get ADC channel number in decimal format
  *         from literals LL_ADC_CHANNEL_x.
  * @note   Example:
  *           __LL_ADC_CHANNEL_TO_DECIMAL_NB(LL_ADC_CHANNEL_4)
  *           will return decimal number "4".
  * @note   The input can be a value from functions where a channel
  *         number is returned, either defined with number
  *         or with bitfield (only one bit must be set).
  * @param  __CHANNEL__ This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0          (2)
  *         @arg @ref LL_ADC_CHANNEL_1          (2)
  *         @arg @ref LL_ADC_CHANNEL_2          (2)
  *         @arg @ref LL_ADC_CHANNEL_3          (2)
  *         @arg @ref LL_ADC_CHANNEL_4          (1)
  *         @arg @ref LL_ADC_CHANNEL_5          (1)
  *         @arg @ref LL_ADC_CHANNEL_6          (2)
  *         @arg @ref LL_ADC_CHANNEL_7          (2)
  *         @arg @ref LL_ADC_CHANNEL_8          (2)
  *         @arg @ref LL_ADC_CHANNEL_9          (2)
  *         @arg @ref LL_ADC_CHANNEL_10         (2)
  *         @arg @ref LL_ADC_CHANNEL_11         (2)
  *         @arg @ref LL_ADC_CHANNEL_12         (2)
  *         @arg @ref LL_ADC_CHANNEL_13         (3)
  *         @arg @ref LL_ADC_CHANNEL_14         (3)
  *         @arg @ref LL_ADC_CHANNEL_15         (3)
  *         @arg @ref LL_ADC_CHANNEL_16         (3)
  *         @arg @ref LL_ADC_CHANNEL_17         (3)
  *         @arg @ref LL_ADC_CHANNEL_18         (3)
  *         @arg @ref LL_ADC_CHANNEL_19         (3)
  *         @arg @ref LL_ADC_CHANNEL_20         (3)
  *         @arg @ref LL_ADC_CHANNEL_21         (3)
  *         @arg @ref LL_ADC_CHANNEL_22         (1)
  *         @arg @ref LL_ADC_CHANNEL_23         (1)
  *         @arg @ref LL_ADC_CHANNEL_24         (1)
  *         @arg @ref LL_ADC_CHANNEL_25         (1)
  *         @arg @ref LL_ADC_CHANNEL_26         (3)
  *         @arg @ref LL_ADC_CHANNEL_27         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_28         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_29         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_30         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_31         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT    (3)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR (3)
  *         @arg @ref LL_ADC_CHANNEL_VCOMP      (3)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP1    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3    (3)(5)
  *         
  *         (1) On STM32L1, connection via routing interface (RI) specificity: fast channel (channel routed directly to ADC switch matrix).\n
  *         (2) On STM32L1, for devices with feature 'channels banks' available: Channel different in bank A and bank B.\n
  *         (3) On STM32L1, for devices with feature 'channels banks' available: Channel common to both bank A and bank B.\n
  *         (4) On STM32L1, parameter not available on all devices: only on STM32L1 Cat.4 and Cat.5.\n
  *         (5) On STM32L1, parameter not available on all devices: OPAMP1 and OPAMP2 available only on STM32L1 Cat.3, Cat.4 and Cat.5, OPAMP3 available only on STM32L1 Cat.4 and Cat.5
  * @retval Value between Min_Data=0 and Max_Data=18
  */
#define __LL_ADC_CHANNEL_TO_DECIMAL_NB(__CHANNEL__)                                        \
  (((__CHANNEL__) & ADC_CHANNEL_ID_NUMBER_MASK) >> ADC_CHANNEL_ID_NUMBER_BITOFFSET_POS)

/**
  * @brief  Helper macro to get ADC channel in literal format LL_ADC_CHANNEL_x
  *         from number in decimal format.
  * @note   Example:
  *           __LL_ADC_DECIMAL_NB_TO_CHANNEL(4)
  *           will return a data equivalent to "LL_ADC_CHANNEL_4".
  * @param  __DECIMAL_NB__: Value between Min_Data=0 and Max_Data=18
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0          (2)
  *         @arg @ref LL_ADC_CHANNEL_1          (2)
  *         @arg @ref LL_ADC_CHANNEL_2          (2)
  *         @arg @ref LL_ADC_CHANNEL_3          (2)
  *         @arg @ref LL_ADC_CHANNEL_4          (1)
  *         @arg @ref LL_ADC_CHANNEL_5          (1)
  *         @arg @ref LL_ADC_CHANNEL_6          (2)
  *         @arg @ref LL_ADC_CHANNEL_7          (2)
  *         @arg @ref LL_ADC_CHANNEL_8          (2)
  *         @arg @ref LL_ADC_CHANNEL_9          (2)
  *         @arg @ref LL_ADC_CHANNEL_10         (2)
  *         @arg @ref LL_ADC_CHANNEL_11         (2)
  *         @arg @ref LL_ADC_CHANNEL_12         (2)
  *         @arg @ref LL_ADC_CHANNEL_13         (3)
  *         @arg @ref LL_ADC_CHANNEL_14         (3)
  *         @arg @ref LL_ADC_CHANNEL_15         (3)
  *         @arg @ref LL_ADC_CHANNEL_16         (3)
  *         @arg @ref LL_ADC_CHANNEL_17         (3)
  *         @arg @ref LL_ADC_CHANNEL_18         (3)
  *         @arg @ref LL_ADC_CHANNEL_19         (3)
  *         @arg @ref LL_ADC_CHANNEL_20         (3)
  *         @arg @ref LL_ADC_CHANNEL_21         (3)
  *         @arg @ref LL_ADC_CHANNEL_22         (1)
  *         @arg @ref LL_ADC_CHANNEL_23         (1)
  *         @arg @ref LL_ADC_CHANNEL_24         (1)
  *         @arg @ref LL_ADC_CHANNEL_25         (1)
  *         @arg @ref LL_ADC_CHANNEL_26         (3)
  *         @arg @ref LL_ADC_CHANNEL_27         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_28         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_29         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_30         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_31         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT    (3)(6)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR (3)(6)
  *         @arg @ref LL_ADC_CHANNEL_VCOMP      (3)(6)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP1    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3    (3)(5)
  *         
  *         (1) On STM32L1, connection via routing interface (RI) specificity: fast channel (channel routed directly to ADC switch matrix).\n
  *         (2) On STM32L1, for devices with feature 'channels banks' available: Channel different in bank A and bank B.\n
  *         (3) On STM32L1, for devices with feature 'channels banks' available: Channel common to both bank A and bank B.\n
  *         (4) On STM32L1, parameter not available on all devices: only on STM32L1 Cat.4 and Cat.5.\n
  *         (5) On STM32L1, parameter not available on all devices: OPAMP1 and OPAMP2 available only on STM32L1 Cat.3, Cat.4 and Cat.5, OPAMP3 available only on STM32L1 Cat.4 and Cat.5.\n
  *         (6) For ADC channel read back from ADC register,
  *             comparison with internal channel parameter to be done
  *             using helper macro @ref __LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL().
  */
#if defined(ADC_SMPR0_SMP31)
#define __LL_ADC_DECIMAL_NB_TO_CHANNEL(__DECIMAL_NB__)                                                                  \
  (((__DECIMAL_NB__) <= 9U)                                                                                             \
    ? (                                                                                                                 \
       ((__DECIMAL_NB__) << ADC_CHANNEL_ID_NUMBER_BITOFFSET_POS)                                       |                \
       (ADC_SMPR3_REGOFFSET | (((uint32_t) (3U * (__DECIMAL_NB__))) << ADC_CHANNEL_SMPx_BITOFFSET_POS))                 \
      )                                                                                                                 \
      :                                                                                                                 \
      (((__DECIMAL_NB__) <= 19U)                                                                                        \
        ? (                                                                                                             \
           ((__DECIMAL_NB__) << ADC_CHANNEL_ID_NUMBER_BITOFFSET_POS)                                       |            \
           (ADC_SMPR2_REGOFFSET | (((uint32_t) (3U * ((__DECIMAL_NB__) -10U))) << ADC_CHANNEL_SMPx_BITOFFSET_POS))      \
          )                                                                                                             \
          :                                                                                                             \
          (((__DECIMAL_NB__) <= 28U)                                                                                    \
            ? (                                                                                                         \
               ((__DECIMAL_NB__) << ADC_CHANNEL_ID_NUMBER_BITOFFSET_POS)                                       |        \
               (ADC_SMPR1_REGOFFSET | (((uint32_t) (3U * ((__DECIMAL_NB__) -20U))) << ADC_CHANNEL_SMPx_BITOFFSET_POS))  \
              )                                                                                                         \
              :                                                                                                         \
              (                                                                                                         \
               ((__DECIMAL_NB__) << ADC_CHANNEL_ID_NUMBER_BITOFFSET_POS)                                              | \
               (ADC_SMPR0_REGOFFSET | (((uint32_t) (3U * ((__DECIMAL_NB__) - 30U))) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) \
              )                                                                                                         \
          )                                                                                                             \
      )                                                                                                                 \
  )
#else
#define __LL_ADC_DECIMAL_NB_TO_CHANNEL(__DECIMAL_NB__)                                                                  \
  (((__DECIMAL_NB__) <= 9U)                                                                                             \
    ? (                                                                                                                 \
       ((__DECIMAL_NB__) << ADC_CHANNEL_ID_NUMBER_BITOFFSET_POS)                                       |                \
       (ADC_SMPR3_REGOFFSET | (((uint32_t) (3U * (__DECIMAL_NB__))) << ADC_CHANNEL_SMPx_BITOFFSET_POS))                 \
      )                                                                                                                 \
      :                                                                                                                 \
      (((__DECIMAL_NB__) <= 19U)                                                                                        \
        ? (                                                                                                             \
           ((__DECIMAL_NB__) << ADC_CHANNEL_ID_NUMBER_BITOFFSET_POS)                                       |            \
           (ADC_SMPR2_REGOFFSET | (((uint32_t) (3U * ((__DECIMAL_NB__) -10U))) << ADC_CHANNEL_SMPx_BITOFFSET_POS))      \
          )                                                                                                             \
          :                                                                                                             \
          (                                                                                                             \
           ((__DECIMAL_NB__) << ADC_CHANNEL_ID_NUMBER_BITOFFSET_POS)                                       |            \
           (ADC_SMPR1_REGOFFSET | (((uint32_t) (3U * ((__DECIMAL_NB__) -20U))) << ADC_CHANNEL_SMPx_BITOFFSET_POS))      \
          )                                                                                                             \
      )                                                                                                                 \
  )
#endif /* ADC_SMPR0_SMP31 */

/**
  * @brief  Helper macro to determine whether the selected channel
  *         corresponds to literal definitions of driver.
  * @note   The different literal definitions of ADC channels are:
  *         - ADC internal channel:
  *           LL_ADC_CHANNEL_VREFINT, LL_ADC_CHANNEL_TEMPSENSOR, ...
  *         - ADC external channel (channel connected to a GPIO pin):
  *           LL_ADC_CHANNEL_1, LL_ADC_CHANNEL_2, ...
  * @note   The channel parameter must be a value defined from literal
  *         definition of a ADC internal channel (LL_ADC_CHANNEL_VREFINT,
  *         LL_ADC_CHANNEL_TEMPSENSOR, ...),
  *         ADC external channel (LL_ADC_CHANNEL_1, LL_ADC_CHANNEL_2, ...),
  *         must not be a value from functions where a channel number is
  *         returned from ADC registers,
  *         because internal and external channels share the same channel
  *         number in ADC registers. The differentiation is made only with
  *         parameters definitions of driver.
  * @param  __CHANNEL__ This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0          (2)
  *         @arg @ref LL_ADC_CHANNEL_1          (2)
  *         @arg @ref LL_ADC_CHANNEL_2          (2)
  *         @arg @ref LL_ADC_CHANNEL_3          (2)
  *         @arg @ref LL_ADC_CHANNEL_4          (1)
  *         @arg @ref LL_ADC_CHANNEL_5          (1)
  *         @arg @ref LL_ADC_CHANNEL_6          (2)
  *         @arg @ref LL_ADC_CHANNEL_7          (2)
  *         @arg @ref LL_ADC_CHANNEL_8          (2)
  *         @arg @ref LL_ADC_CHANNEL_9          (2)
  *         @arg @ref LL_ADC_CHANNEL_10         (2)
  *         @arg @ref LL_ADC_CHANNEL_11         (2)
  *         @arg @ref LL_ADC_CHANNEL_12         (2)
  *         @arg @ref LL_ADC_CHANNEL_13         (3)
  *         @arg @ref LL_ADC_CHANNEL_14         (3)
  *         @arg @ref LL_ADC_CHANNEL_15         (3)
  *         @arg @ref LL_ADC_CHANNEL_16         (3)
  *         @arg @ref LL_ADC_CHANNEL_17         (3)
  *         @arg @ref LL_ADC_CHANNEL_18         (3)
  *         @arg @ref LL_ADC_CHANNEL_19         (3)
  *         @arg @ref LL_ADC_CHANNEL_20         (3)
  *         @arg @ref LL_ADC_CHANNEL_21         (3)
  *         @arg @ref LL_ADC_CHANNEL_22         (1)
  *         @arg @ref LL_ADC_CHANNEL_23         (1)
  *         @arg @ref LL_ADC_CHANNEL_24         (1)
  *         @arg @ref LL_ADC_CHANNEL_25         (1)
  *         @arg @ref LL_ADC_CHANNEL_26         (3)
  *         @arg @ref LL_ADC_CHANNEL_27         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_28         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_29         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_30         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_31         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT    (3)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR (3)
  *         @arg @ref LL_ADC_CHANNEL_VCOMP      (3)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP1    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3    (3)(5)
  *         
  *         (1) On STM32L1, connection via routing interface (RI) specificity: fast channel (channel routed directly to ADC switch matrix).\n
  *         (2) On STM32L1, for devices with feature 'channels banks' available: Channel different in bank A and bank B.\n
  *         (3) On STM32L1, for devices with feature 'channels banks' available: Channel common to both bank A and bank B.\n
  *         (4) On STM32L1, parameter not available on all devices: only on STM32L1 Cat.4 and Cat.5.\n
  *         (5) On STM32L1, parameter not available on all devices: OPAMP1 and OPAMP2 available only on STM32L1 Cat.3, Cat.4 and Cat.5, OPAMP3 available only on STM32L1 Cat.4 and Cat.5
  * @retval Value "0" if the channel corresponds to a parameter definition of a ADC external channel (channel connected to a GPIO pin).
  *         Value "1" if the channel corresponds to a parameter definition of a ADC internal channel.
  */
#define __LL_ADC_IS_CHANNEL_INTERNAL(__CHANNEL__)                              \
  (((__CHANNEL__) & ADC_CHANNEL_ID_INTERNAL_CH_MASK) != 0U)

/**
  * @brief  Helper macro to convert a channel defined from parameter
  *         definition of a ADC internal channel (LL_ADC_CHANNEL_VREFINT,
  *         LL_ADC_CHANNEL_TEMPSENSOR, ...),
  *         to its equivalent parameter definition of a ADC external channel
  *         (LL_ADC_CHANNEL_1, LL_ADC_CHANNEL_2, ...).
  * @note   The channel parameter can be, additionally to a value
  *         defined from parameter definition of a ADC internal channel
  *         (LL_ADC_CHANNEL_VREFINT, LL_ADC_CHANNEL_TEMPSENSOR, ...),
  *         a value defined from parameter definition of
  *         ADC external channel (LL_ADC_CHANNEL_1, LL_ADC_CHANNEL_2, ...)
  *         or a value from functions where a channel number is returned
  *         from ADC registers.
  * @param  __CHANNEL__ This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0          (2)
  *         @arg @ref LL_ADC_CHANNEL_1          (2)
  *         @arg @ref LL_ADC_CHANNEL_2          (2)
  *         @arg @ref LL_ADC_CHANNEL_3          (2)
  *         @arg @ref LL_ADC_CHANNEL_4          (1)
  *         @arg @ref LL_ADC_CHANNEL_5          (1)
  *         @arg @ref LL_ADC_CHANNEL_6          (2)
  *         @arg @ref LL_ADC_CHANNEL_7          (2)
  *         @arg @ref LL_ADC_CHANNEL_8          (2)
  *         @arg @ref LL_ADC_CHANNEL_9          (2)
  *         @arg @ref LL_ADC_CHANNEL_10         (2)
  *         @arg @ref LL_ADC_CHANNEL_11         (2)
  *         @arg @ref LL_ADC_CHANNEL_12         (2)
  *         @arg @ref LL_ADC_CHANNEL_13         (3)
  *         @arg @ref LL_ADC_CHANNEL_14         (3)
  *         @arg @ref LL_ADC_CHANNEL_15         (3)
  *         @arg @ref LL_ADC_CHANNEL_16         (3)
  *         @arg @ref LL_ADC_CHANNEL_17         (3)
  *         @arg @ref LL_ADC_CHANNEL_18         (3)
  *         @arg @ref LL_ADC_CHANNEL_19         (3)
  *         @arg @ref LL_ADC_CHANNEL_20         (3)
  *         @arg @ref LL_ADC_CHANNEL_21         (3)
  *         @arg @ref LL_ADC_CHANNEL_22         (1)
  *         @arg @ref LL_ADC_CHANNEL_23         (1)
  *         @arg @ref LL_ADC_CHANNEL_24         (1)
  *         @arg @ref LL_ADC_CHANNEL_25         (1)
  *         @arg @ref LL_ADC_CHANNEL_26         (3)
  *         @arg @ref LL_ADC_CHANNEL_27         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_28         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_29         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_30         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_31         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT    (3)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR (3)
  *         @arg @ref LL_ADC_CHANNEL_VCOMP      (3)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP1    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3    (3)(5)
  *         
  *         (1) On STM32L1, connection via routing interface (RI) specificity: fast channel (channel routed directly to ADC switch matrix).\n
  *         (2) On STM32L1, for devices with feature 'channels banks' available: Channel different in bank A and bank B.\n
  *         (3) On STM32L1, for devices with feature 'channels banks' available: Channel common to both bank A and bank B.\n
  *         (4) On STM32L1, parameter not available on all devices: only on STM32L1 Cat.4 and Cat.5.\n
  *         (5) On STM32L1, parameter not available on all devices: OPAMP1 and OPAMP2 available only on STM32L1 Cat.3, Cat.4 and Cat.5, OPAMP3 available only on STM32L1 Cat.4 and Cat.5
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_14
  *         @arg @ref LL_ADC_CHANNEL_15
  *         @arg @ref LL_ADC_CHANNEL_16
  *         @arg @ref LL_ADC_CHANNEL_17
  *         @arg @ref LL_ADC_CHANNEL_18
  */
#define __LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(__CHANNEL__)                     \
  ((__CHANNEL__) & ~ADC_CHANNEL_ID_INTERNAL_CH_MASK)

