zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32l1xx/drivers/include/stm32l1xx_ll_adc.h
/**
  * @brief  Helper macro to determine whether the internal channel
  *         selected is available on the ADC instance selected.
  * @note   The channel parameter must be a value defined from parameter
  *         definition of a ADC internal channel (LL_ADC_CHANNEL_VREFINT,
  *         LL_ADC_CHANNEL_TEMPSENSOR, ...),
  *         must not be a value defined from parameter definition of
  *         ADC external channel (LL_ADC_CHANNEL_1, LL_ADC_CHANNEL_2, ...)
  *         or a value from functions where a channel number is
  *         returned from ADC registers,
  *         because internal and external channels share the same channel
  *         number in ADC registers. The differentiation is made only with
  *         parameters definitions of driver.
  * @param  __ADC_INSTANCE__ ADC instance
  * @param  __CHANNEL__ This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_VREFINT    (3)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR (3)
  *         @arg @ref LL_ADC_CHANNEL_VCOMP      (3)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP1    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3    (3)(5)
  *         
  *         (1) On STM32L1, connection via routing interface (RI) specificity: fast channel (channel routed directly to ADC switch matrix).\n
  *         (2) On STM32L1, for devices with feature 'channels banks' available: Channel different in bank A and bank B.\n
  *         (3) On STM32L1, for devices with feature 'channels banks' available: Channel common to both bank A and bank B.\n
  *         (4) On STM32L1, parameter not available on all devices: only on STM32L1 Cat.4 and Cat.5.\n
  *         (5) On STM32L1, parameter not available on all devices: OPAMP1 and OPAMP2 available only on STM32L1 Cat.3, Cat.4 and Cat.5, OPAMP3 available only on STM32L1 Cat.4 and Cat.5
  * @retval Value "0" if the internal channel selected is not available on the ADC instance selected.
  *         Value "1" if the internal channel selected is available on the ADC instance selected.
  */
#if defined (OPAMP_CSR_OPA3PD)
#define __LL_ADC_IS_CHANNEL_INTERNAL_AVAILABLE(__ADC_INSTANCE__, __CHANNEL__)  \
  (                                                                            \
    ((__CHANNEL__) == LL_ADC_CHANNEL_VREFINT)    ||                            \
    ((__CHANNEL__) == LL_ADC_CHANNEL_TEMPSENSOR) ||                            \
    ((__CHANNEL__) == LL_ADC_CHANNEL_VCOMP)      ||                            \
    ((__CHANNEL__) == LL_ADC_CHANNEL_VOPAMP1)    ||                            \
    ((__CHANNEL__) == LL_ADC_CHANNEL_VOPAMP2)    ||                            \
    ((__CHANNEL__) == LL_ADC_CHANNEL_VOPAMP3)                                  \
  )
#elif defined(OPAMP_CSR_OPA1PD) || defined (OPAMP_CSR_OPA2PD)
#define __LL_ADC_IS_CHANNEL_INTERNAL_AVAILABLE(__ADC_INSTANCE__, __CHANNEL__)  \
  (                                                                            \
    ((__CHANNEL__) == LL_ADC_CHANNEL_VREFINT)    ||                            \
    ((__CHANNEL__) == LL_ADC_CHANNEL_TEMPSENSOR) ||                            \
    ((__CHANNEL__) == LL_ADC_CHANNEL_VCOMP)      ||                            \
    ((__CHANNEL__) == LL_ADC_CHANNEL_VOPAMP1)    ||                            \
    ((__CHANNEL__) == LL_ADC_CHANNEL_VOPAMP2)                                  \
  )
#else
#define __LL_ADC_IS_CHANNEL_INTERNAL_AVAILABLE(__ADC_INSTANCE__, __CHANNEL__)  \
  (                                                                            \
    ((__CHANNEL__) == LL_ADC_CHANNEL_VREFINT)    ||                            \
    ((__CHANNEL__) == LL_ADC_CHANNEL_TEMPSENSOR) ||                            \
    ((__CHANNEL__) == LL_ADC_CHANNEL_VCOMP)                                    \
  )
#endif

/**
  * @brief  Helper macro to define ADC analog watchdog parameter:
  *         define a single channel to monitor with analog watchdog
  *         from sequencer channel and groups definition.
  * @note   To be used with function @ref LL_ADC_SetAnalogWDMonitChannels().
  *         Example:
  *           LL_ADC_SetAnalogWDMonitChannels(
  *             ADC1, LL_ADC_AWD1,
  *             __LL_ADC_ANALOGWD_CHANNEL_GROUP(LL_ADC_CHANNEL4, LL_ADC_GROUP_REGULAR))
  * @param  __CHANNEL__ This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0          (2)
  *         @arg @ref LL_ADC_CHANNEL_1          (2)
  *         @arg @ref LL_ADC_CHANNEL_2          (2)
  *         @arg @ref LL_ADC_CHANNEL_3          (2)
  *         @arg @ref LL_ADC_CHANNEL_4          (1)
  *         @arg @ref LL_ADC_CHANNEL_5          (1)
  *         @arg @ref LL_ADC_CHANNEL_6          (2)
  *         @arg @ref LL_ADC_CHANNEL_7          (2)
  *         @arg @ref LL_ADC_CHANNEL_8          (2)
  *         @arg @ref LL_ADC_CHANNEL_9          (2)
  *         @arg @ref LL_ADC_CHANNEL_10         (2)
  *         @arg @ref LL_ADC_CHANNEL_11         (2)
  *         @arg @ref LL_ADC_CHANNEL_12         (2)
  *         @arg @ref LL_ADC_CHANNEL_13         (3)
  *         @arg @ref LL_ADC_CHANNEL_14         (3)
  *         @arg @ref LL_ADC_CHANNEL_15         (3)
  *         @arg @ref LL_ADC_CHANNEL_16         (3)
  *         @arg @ref LL_ADC_CHANNEL_17         (3)
  *         @arg @ref LL_ADC_CHANNEL_18         (3)
  *         @arg @ref LL_ADC_CHANNEL_19         (3)
  *         @arg @ref LL_ADC_CHANNEL_20         (3)
  *         @arg @ref LL_ADC_CHANNEL_21         (3)
  *         @arg @ref LL_ADC_CHANNEL_22         (1)
  *         @arg @ref LL_ADC_CHANNEL_23         (1)
  *         @arg @ref LL_ADC_CHANNEL_24         (1)
  *         @arg @ref LL_ADC_CHANNEL_25         (1)
  *         @arg @ref LL_ADC_CHANNEL_26         (3)
  *         @arg @ref LL_ADC_CHANNEL_27         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_28         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_29         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_30         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_31         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT    (3)(6)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR (3)(6)
  *         @arg @ref LL_ADC_CHANNEL_VCOMP      (3)(6)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP1    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3    (3)(5)
  *         
  *         (1) On STM32L1, connection via routing interface (RI) specificity: fast channel (channel routed directly to ADC switch matrix).\n
  *         (2) On STM32L1, for devices with feature 'channels banks' available: Channel different in bank A and bank B.\n
  *         (3) On STM32L1, for devices with feature 'channels banks' available: Channel common to both bank A and bank B.\n
  *         (4) On STM32L1, parameter not available on all devices: only on STM32L1 Cat.4 and Cat.5.\n
  *         (5) On STM32L1, parameter not available on all devices: OPAMP1 and OPAMP2 available only on STM32L1 Cat.3, Cat.4 and Cat.5, OPAMP3 available only on STM32L1 Cat.4 and Cat.5.\n
  *         (6) For ADC channel read back from ADC register,
  *             comparison with internal channel parameter to be done
  *             using helper macro @ref __LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL().
  * @param  __GROUP__ This parameter can be one of the following values:
  *         @arg @ref LL_ADC_GROUP_REGULAR
  *         @arg @ref LL_ADC_GROUP_INJECTED
  *         @arg @ref LL_ADC_GROUP_REGULAR_INJECTED
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_AWD_DISABLE
  *         @arg @ref LL_ADC_AWD_ALL_CHANNELS_REG
  *         @arg @ref LL_ADC_AWD_ALL_CHANNELS_INJ
  *         @arg @ref LL_ADC_AWD_ALL_CHANNELS_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_0_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_0_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_0_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_1_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_1_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_1_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_2_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_2_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_2_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_3_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_3_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_3_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_4_REG           (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_4_INJ           (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_4_REG_INJ       (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_5_REG           (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_5_INJ           (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_5_REG_INJ       (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_6_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_6_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_6_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_7_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_7_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_7_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_8_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_8_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_8_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_9_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_9_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_9_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_10_REG          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_10_INJ          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_10_REG_INJ      (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_11_REG          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_11_INJ          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_11_REG_INJ      (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_12_REG          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_12_INJ          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_12_REG_INJ      (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_13_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_13_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_13_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_14_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_14_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_14_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_15_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_15_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_15_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_16_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_16_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_16_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_17_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_17_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_17_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_18_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_18_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_18_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_19_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_19_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_19_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_20_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_20_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_20_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_21_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_21_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_21_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_22_REG          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_22_INJ          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_22_REG_INJ      (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_23_REG          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_23_INJ          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_23_REG_INJ      (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_24_REG          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_24_INJ          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_24_REG_INJ      (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_25_REG          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_25_INJ          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_25_REG_INJ      (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_26_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_26_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_26_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_27_REG          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_27_INJ          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_27_REG_INJ      (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_28_REG          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_28_INJ          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_28_REG_INJ      (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_29_REG          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_29_INJ          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_29_REG_INJ      (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_30_REG          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_30_INJ          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_30_REG_INJ      (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_31_REG          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_31_INJ          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_31_REG_INJ      (3)(4)
  *         @arg @ref LL_ADC_AWD_CH_VREFINT_REG          (3)
  *         @arg @ref LL_ADC_AWD_CH_VREFINT_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CH_VREFINT_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CH_TEMPSENSOR_REG       (3)
  *         @arg @ref LL_ADC_AWD_CH_TEMPSENSOR_INJ       (3)
  *         @arg @ref LL_ADC_AWD_CH_TEMPSENSOR_REG_INJ   (3)
  *         @arg @ref LL_ADC_AWD_CH_VCOMP_REG            (3)
  *         @arg @ref LL_ADC_AWD_CH_VCOMP_INJ            (3)
  *         @arg @ref LL_ADC_AWD_CH_VCOMP_REG_INJ        (3)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP1_REG          (3)(5)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP1_INJ          (3)(5)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP1_REG_INJ      (3)(5)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP2_REG          (3)(5)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP2_INJ          (3)(5)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP2_REG_INJ      (3)(5)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP3_REG          (3)(5)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP3_INJ          (3)(5)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP3_REG_INJ      (3)(5)
  *         
  *         (1) On STM32L1, connection via routing interface (RI) specificity: fast channel (channel routed directly to ADC switch matrix).\n
  *         (2) On STM32L1, for devices with feature 'channels banks' available: Channel different in bank A and bank B.\n
  *         (3) On STM32L1, for devices with feature 'channels banks' available: Channel common to both bank A and bank B.\n
  *         (4) On STM32L1, parameter not available on all devices: only on STM32L1 Cat.4 and Cat.5.\n
  *         (5) On STM32L1, parameter not available on all devices: OPAMP1 and OPAMP2 available only on STM32L1 Cat.3, Cat.4 and Cat.5, OPAMP3 available only on STM32L1 Cat.4 and Cat.5
  */
#define __LL_ADC_ANALOGWD_CHANNEL_GROUP(__CHANNEL__, __GROUP__)                                           \
  (((__GROUP__) == LL_ADC_GROUP_REGULAR)                                                                  \
    ? (((__CHANNEL__) & ADC_CHANNEL_ID_MASK) | ADC_CR1_AWDEN | ADC_CR1_AWDSGL)                            \
      :                                                                                                   \
      ((__GROUP__) == LL_ADC_GROUP_INJECTED)                                                              \
       ? (((__CHANNEL__) & ADC_CHANNEL_ID_MASK) | ADC_CR1_JAWDEN | ADC_CR1_AWDSGL)                        \
         :                                                                                                \
         (((__CHANNEL__) & ADC_CHANNEL_ID_MASK) | ADC_CR1_JAWDEN | ADC_CR1_AWDEN | ADC_CR1_AWDSGL)        \
  )

/**
  * @brief  Helper macro to set the value of ADC analog watchdog threshold high
  *         or low in function of ADC resolution, when ADC resolution is
  *         different of 12 bits.
  * @note   To be used with function @ref LL_ADC_SetAnalogWDThresholds().
  *         Example, with a ADC resolution of 8 bits, to set the value of
  *         analog watchdog threshold high (on 8 bits):
  *           LL_ADC_SetAnalogWDThresholds
  *            (< ADCx param >,
  *             __LL_ADC_ANALOGWD_SET_THRESHOLD_RESOLUTION(LL_ADC_RESOLUTION_8B, <threshold_value_8_bits>)
  *            );
  * @param  __ADC_RESOLUTION__ This parameter can be one of the following values:
  *         @arg @ref LL_ADC_RESOLUTION_12B
  *         @arg @ref LL_ADC_RESOLUTION_10B
  *         @arg @ref LL_ADC_RESOLUTION_8B
  *         @arg @ref LL_ADC_RESOLUTION_6B
  * @param  __AWD_THRESHOLD__ Value between Min_Data=0x000 and Max_Data=0xFFF
  * @retval Value between Min_Data=0x000 and Max_Data=0xFFF
  */
#define __LL_ADC_ANALOGWD_SET_THRESHOLD_RESOLUTION(__ADC_RESOLUTION__, __AWD_THRESHOLD__) \
  ((__AWD_THRESHOLD__) << ((__ADC_RESOLUTION__) >> (ADC_CR1_RES_BITOFFSET_POS - 1U )))

/**
  * @brief  Helper macro to get the value of ADC analog watchdog threshold high
  *         or low in function of ADC resolution, when ADC resolution is 
  *         different of 12 bits.
  * @note   To be used with function @ref LL_ADC_GetAnalogWDThresholds().
  *         Example, with a ADC resolution of 8 bits, to get the value of
  *         analog watchdog threshold high (on 8 bits):
  *           < threshold_value_6_bits > = __LL_ADC_ANALOGWD_GET_THRESHOLD_RESOLUTION
  *            (LL_ADC_RESOLUTION_8B,
  *             LL_ADC_GetAnalogWDThresholds(<ADCx param>, LL_ADC_AWD_THRESHOLD_HIGH)
  *            );
  * @param  __ADC_RESOLUTION__ This parameter can be one of the following values:
  *         @arg @ref LL_ADC_RESOLUTION_12B
  *         @arg @ref LL_ADC_RESOLUTION_10B
  *         @arg @ref LL_ADC_RESOLUTION_8B
  *         @arg @ref LL_ADC_RESOLUTION_6B
  * @param  __AWD_THRESHOLD_12_BITS__ Value between Min_Data=0x000 and Max_Data=0xFFF
  * @retval Value between Min_Data=0x000 and Max_Data=0xFFF
  */
#define __LL_ADC_ANALOGWD_GET_THRESHOLD_RESOLUTION(__ADC_RESOLUTION__, __AWD_THRESHOLD_12_BITS__) \
  ((__AWD_THRESHOLD_12_BITS__) >> ((__ADC_RESOLUTION__) >> (ADC_CR1_RES_BITOFFSET_POS - 1U )))

/**
  * @brief  Helper macro to select the ADC common instance
  *         to which is belonging the selected ADC instance.
  * @note   ADC common register instance can be used for:
  *         - Set parameters common to several ADC instances
  *         - Multimode (for devices with several ADC instances)
  *         Refer to functions having argument "ADCxy_COMMON" as parameter.
  * @param  __ADCx__ ADC instance
  * @retval ADC common register instance
  */
#define __LL_ADC_COMMON_INSTANCE(__ADCx__)                                     \
  (ADC1_COMMON)
  
/**
  * @brief  Helper macro to check if all ADC instances sharing the same
  *         ADC common instance are disabled.
  * @note   This check is required by functions with setting conditioned to
  *         ADC state:
  *         All ADC instances of the ADC common group must be disabled.
  *         Refer to functions having argument "ADCxy_COMMON" as parameter.
  * @note   On devices with only 1 ADC common instance, parameter of this macro
  *         is useless and can be ignored (parameter kept for compatibility
  *         with devices featuring several ADC common instances).
  * @param  __ADCXY_COMMON__ ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __LL_ADC_COMMON_INSTANCE() )
  * @retval Value "0" if all ADC instances sharing the same ADC common instance
  *         are disabled.
  *         Value "1" if at least one ADC instance sharing the same ADC common instance
  *         is enabled.
  */
#define __LL_ADC_IS_ENABLED_ALL_COMMON_INSTANCE(__ADCXY_COMMON__)              \
  LL_ADC_IsEnabled(ADC1)

/**
  * @brief  Helper macro to define the ADC conversion data full-scale digital
  *         value corresponding to the selected ADC resolution.
  * @note   ADC conversion data full-scale corresponds to voltage range
  *         determined by analog voltage references Vref+ and Vref-
  *         (refer to reference manual).
  * @param  __ADC_RESOLUTION__ This parameter can be one of the following values:
  *         @arg @ref LL_ADC_RESOLUTION_12B
  *         @arg @ref LL_ADC_RESOLUTION_10B
  *         @arg @ref LL_ADC_RESOLUTION_8B
  *         @arg @ref LL_ADC_RESOLUTION_6B
  * @retval ADC conversion data equivalent voltage value (unit: mVolt)
  */
#define __LL_ADC_DIGITAL_SCALE(__ADC_RESOLUTION__)                             \
  (0xFFFU >> ((__ADC_RESOLUTION__) >> (ADC_CR1_RES_BITOFFSET_POS - 1U)))

/**
  * @brief  Helper macro to convert the ADC conversion data from
  *         a resolution to another resolution.
  * @param  __DATA__ ADC conversion data to be converted 
  * @param  __ADC_RESOLUTION_CURRENT__ Resolution of to the data to be converted
  *         This parameter can be one of the following values:
  *         @arg @ref LL_ADC_RESOLUTION_12B
  *         @arg @ref LL_ADC_RESOLUTION_10B
  *         @arg @ref LL_ADC_RESOLUTION_8B
  *         @arg @ref LL_ADC_RESOLUTION_6B
  * @param  __ADC_RESOLUTION_TARGET__ Resolution of the data after conversion
  *         This parameter can be one of the following values:
  *         @arg @ref LL_ADC_RESOLUTION_12B
  *         @arg @ref LL_ADC_RESOLUTION_10B
  *         @arg @ref LL_ADC_RESOLUTION_8B
  *         @arg @ref LL_ADC_RESOLUTION_6B
  * @retval ADC conversion data to the requested resolution
  */
#define __LL_ADC_CONVERT_DATA_RESOLUTION(__DATA__, __ADC_RESOLUTION_CURRENT__, __ADC_RESOLUTION_TARGET__) \
  (((__DATA__)                                                                 \
    << ((__ADC_RESOLUTION_CURRENT__) >> (ADC_CR1_RES_BITOFFSET_POS - 1U)))     \
   >> ((__ADC_RESOLUTION_TARGET__) >> (ADC_CR1_RES_BITOFFSET_POS - 1U))        \
  )

