zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32l1xx/drivers/include/stm32l1xx_ll_adc.h
/**
  * @brief  Set ADC group injected sequencer discontinuous mode:
  *         sequence subdivided and scan conversions interrupted every selected
  *         number of ranks.
  * @note   It is not possible to enable both ADC group injected
  *         auto-injected mode and sequencer discontinuous mode.
  * @rmtoll CR1      DISCEN         LL_ADC_INJ_SetSequencerDiscont
  * @param  ADCx ADC instance
  * @param  SeqDiscont This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_SEQ_DISCONT_DISABLE
  *         @arg @ref LL_ADC_INJ_SEQ_DISCONT_1RANK
  * @retval None
  */
__STATIC_INLINE void LL_ADC_INJ_SetSequencerDiscont(ADC_TypeDef *ADCx, uint32_t SeqDiscont)
{
  MODIFY_REG(ADCx->CR1, ADC_CR1_JDISCEN, SeqDiscont);
}

/**
  * @brief  Get ADC group injected sequencer discontinuous mode:
  *         sequence subdivided and scan conversions interrupted every selected
  *         number of ranks.
  * @rmtoll CR1      DISCEN         LL_ADC_REG_GetSequencerDiscont
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_INJ_SEQ_DISCONT_DISABLE
  *         @arg @ref LL_ADC_INJ_SEQ_DISCONT_1RANK
  */
__STATIC_INLINE uint32_t LL_ADC_INJ_GetSequencerDiscont(ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CR1, ADC_CR1_JDISCEN));
}

/**
  * @brief  Set ADC group injected sequence: channel on the selected
  *         sequence rank.
  * @note   Depending on devices and packages, some channels may not be available.
  *         Refer to device datasheet for channels availability.
  * @note   On this STM32 serie, to measure internal channels (VrefInt,
  *         TempSensor, ...), measurement paths to internal channels must be
  *         enabled separately.
  *         This can be done using function @ref LL_ADC_SetCommonPathInternalCh().
  * @rmtoll JSQR     JSQ1           LL_ADC_INJ_SetSequencerRanks\n
  *         JSQR     JSQ2           LL_ADC_INJ_SetSequencerRanks\n
  *         JSQR     JSQ3           LL_ADC_INJ_SetSequencerRanks\n
  *         JSQR     JSQ4           LL_ADC_INJ_SetSequencerRanks
  * @param  ADCx ADC instance
  * @param  Rank This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0          (2)
  *         @arg @ref LL_ADC_CHANNEL_1          (2)
  *         @arg @ref LL_ADC_CHANNEL_2          (2)
  *         @arg @ref LL_ADC_CHANNEL_3          (2)
  *         @arg @ref LL_ADC_CHANNEL_4          (1)
  *         @arg @ref LL_ADC_CHANNEL_5          (1)
  *         @arg @ref LL_ADC_CHANNEL_6          (2)
  *         @arg @ref LL_ADC_CHANNEL_7          (2)
  *         @arg @ref LL_ADC_CHANNEL_8          (2)
  *         @arg @ref LL_ADC_CHANNEL_9          (2)
  *         @arg @ref LL_ADC_CHANNEL_10         (2)
  *         @arg @ref LL_ADC_CHANNEL_11         (2)
  *         @arg @ref LL_ADC_CHANNEL_12         (2)
  *         @arg @ref LL_ADC_CHANNEL_13         (3)
  *         @arg @ref LL_ADC_CHANNEL_14         (3)
  *         @arg @ref LL_ADC_CHANNEL_15         (3)
  *         @arg @ref LL_ADC_CHANNEL_16         (3)
  *         @arg @ref LL_ADC_CHANNEL_17         (3)
  *         @arg @ref LL_ADC_CHANNEL_18         (3)
  *         @arg @ref LL_ADC_CHANNEL_19         (3)
  *         @arg @ref LL_ADC_CHANNEL_20         (3)
  *         @arg @ref LL_ADC_CHANNEL_21         (3)
  *         @arg @ref LL_ADC_CHANNEL_22         (1)
  *         @arg @ref LL_ADC_CHANNEL_23         (1)
  *         @arg @ref LL_ADC_CHANNEL_24         (1)
  *         @arg @ref LL_ADC_CHANNEL_25         (1)
  *         @arg @ref LL_ADC_CHANNEL_26         (3)
  *         @arg @ref LL_ADC_CHANNEL_27         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_28         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_29         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_30         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_31         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT    (3)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR (3)
  *         @arg @ref LL_ADC_CHANNEL_VCOMP      (3)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP1    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3    (3)(5)
  *         
  *         (1) On STM32L1, connection via routing interface (RI) specificity: fast channel (channel routed directly to ADC switch matrix).\n
  *         (2) On STM32L1, for devices with feature 'channels banks' available: Channel different in bank A and bank B.\n
  *         (3) On STM32L1, for devices with feature 'channels banks' available: Channel common to both bank A and bank B.\n
  *         (4) On STM32L1, parameter not available on all devices: only on STM32L1 Cat.4 and Cat.5.\n
  *         (5) On STM32L1, parameter not available on all devices: OPAMP1 and OPAMP2 available only on STM32L1 Cat.3, Cat.4 and Cat.5, OPAMP3 available only on STM32L1 Cat.4 and Cat.5
  * @retval None
  */
__STATIC_INLINE void LL_ADC_INJ_SetSequencerRanks(ADC_TypeDef *ADCx, uint32_t Rank, uint32_t Channel)
{
  /* Set bits with content of parameter "Channel" with bits position          */
  /* in register depending on parameter "Rank".                               */
  /* Parameters "Rank" and "Channel" are used with masks because containing   */
  /* other bits reserved for other purpose.                                   */
  MODIFY_REG(ADCx->JSQR,
             ADC_CHANNEL_ID_NUMBER_MASK << (Rank & ADC_INJ_RANK_ID_JSQR_MASK),
             (Channel & ADC_CHANNEL_ID_NUMBER_MASK) << (Rank & ADC_INJ_RANK_ID_JSQR_MASK));
}

/**
  * @brief  Get ADC group injected sequence: channel on the selected
  *         sequence rank.
  * @note   Depending on devices and packages, some channels may not be available.
  *         Refer to device datasheet for channels availability.
  * @note   Usage of the returned channel number:
  *         - To reinject this channel into another function LL_ADC_xxx:
  *           the returned channel number is only partly formatted on definition
  *           of literals LL_ADC_CHANNEL_x. Therefore, it has to be compared
  *           with parts of literals LL_ADC_CHANNEL_x or using
  *           helper macro @ref __LL_ADC_CHANNEL_TO_DECIMAL_NB().
  *           Then the selected literal LL_ADC_CHANNEL_x can be used
  *           as parameter for another function.
  *         - To get the channel number in decimal format:
  *           process the returned value with the helper macro
  *           @ref __LL_ADC_CHANNEL_TO_DECIMAL_NB().
  * @rmtoll JSQR     JSQ1           LL_ADC_INJ_SetSequencerRanks\n
  *         JSQR     JSQ2           LL_ADC_INJ_SetSequencerRanks\n
  *         JSQR     JSQ3           LL_ADC_INJ_SetSequencerRanks\n
  *         JSQR     JSQ4           LL_ADC_INJ_SetSequencerRanks
  * @param  ADCx ADC instance
  * @param  Rank This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0          (2)
  *         @arg @ref LL_ADC_CHANNEL_1          (2)
  *         @arg @ref LL_ADC_CHANNEL_2          (2)
  *         @arg @ref LL_ADC_CHANNEL_3          (2)
  *         @arg @ref LL_ADC_CHANNEL_4          (1)
  *         @arg @ref LL_ADC_CHANNEL_5          (1)
  *         @arg @ref LL_ADC_CHANNEL_6          (2)
  *         @arg @ref LL_ADC_CHANNEL_7          (2)
  *         @arg @ref LL_ADC_CHANNEL_8          (2)
  *         @arg @ref LL_ADC_CHANNEL_9          (2)
  *         @arg @ref LL_ADC_CHANNEL_10         (2)
  *         @arg @ref LL_ADC_CHANNEL_11         (2)
  *         @arg @ref LL_ADC_CHANNEL_12         (2)
  *         @arg @ref LL_ADC_CHANNEL_13         (3)
  *         @arg @ref LL_ADC_CHANNEL_14         (3)
  *         @arg @ref LL_ADC_CHANNEL_15         (3)
  *         @arg @ref LL_ADC_CHANNEL_16         (3)
  *         @arg @ref LL_ADC_CHANNEL_17         (3)
  *         @arg @ref LL_ADC_CHANNEL_18         (3)
  *         @arg @ref LL_ADC_CHANNEL_19         (3)
  *         @arg @ref LL_ADC_CHANNEL_20         (3)
  *         @arg @ref LL_ADC_CHANNEL_21         (3)
  *         @arg @ref LL_ADC_CHANNEL_22         (1)
  *         @arg @ref LL_ADC_CHANNEL_23         (1)
  *         @arg @ref LL_ADC_CHANNEL_24         (1)
  *         @arg @ref LL_ADC_CHANNEL_25         (1)
  *         @arg @ref LL_ADC_CHANNEL_26         (3)
  *         @arg @ref LL_ADC_CHANNEL_27         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_28         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_29         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_30         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_31         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT    (3)(6)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR (3)(6)
  *         @arg @ref LL_ADC_CHANNEL_VCOMP      (3)(6)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP1    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3    (3)(5)
  *         
  *         (1) On STM32L1, connection via routing interface (RI) specificity: fast channel (channel routed directly to ADC switch matrix).\n
  *         (2) On STM32L1, for devices with feature 'channels banks' available: Channel different in bank A and bank B.\n
  *         (3) On STM32L1, for devices with feature 'channels banks' available: Channel common to both bank A and bank B.\n
  *         (4) On STM32L1, parameter not available on all devices: only on STM32L1 Cat.4 and Cat.5.\n
  *         (5) On STM32L1, parameter not available on all devices: OPAMP1 and OPAMP2 available only on STM32L1 Cat.3, Cat.4 and Cat.5, OPAMP3 available only on STM32L1 Cat.4 and Cat.5.\n
  *         (6) For ADC channel read back from ADC register,
  *             comparison with internal channel parameter to be done
  *             using helper macro @ref __LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL().
  */
__STATIC_INLINE uint32_t LL_ADC_INJ_GetSequencerRanks(ADC_TypeDef *ADCx, uint32_t Rank)
{
  return (uint32_t)(READ_BIT(ADCx->JSQR,
                             ADC_CHANNEL_ID_NUMBER_MASK << (Rank & ADC_INJ_RANK_ID_JSQR_MASK))
                    >> (Rank & ADC_INJ_RANK_ID_JSQR_MASK)
                   );
}

/**
  * @brief  Set ADC group injected conversion trigger:
  *         independent or from ADC group regular.
  * @note   This mode can be used to extend number of data registers
  *         updated after one ADC conversion trigger and with data 
  *         permanently kept (not erased by successive conversions of scan of
  *         ADC sequencer ranks), up to 5 data registers:
  *         1 data register on ADC group regular, 4 data registers
  *         on ADC group injected.            
  * @note   If ADC group injected injected trigger source is set to an
  *         external trigger, this feature must be must be set to
  *         independent trigger.
  *         ADC group injected automatic trigger is compliant only with 
  *         group injected trigger source set to SW start, without any 
  *         further action on  ADC group injected conversion start or stop: 
  *         in this case, ADC group injected is controlled only 
  *         from ADC group regular.
  * @note   It is not possible to enable both ADC group injected
  *         auto-injected mode and sequencer discontinuous mode.
  * @rmtoll CR1      JAUTO          LL_ADC_INJ_SetTrigAuto
  * @param  ADCx ADC instance
  * @param  TrigAuto This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_TRIG_INDEPENDENT
  *         @arg @ref LL_ADC_INJ_TRIG_FROM_GRP_REGULAR
  * @retval None
  */
__STATIC_INLINE void LL_ADC_INJ_SetTrigAuto(ADC_TypeDef *ADCx, uint32_t TrigAuto)
{
  MODIFY_REG(ADCx->CR1, ADC_CR1_JAUTO, TrigAuto);
}

/**
  * @brief  Get ADC group injected conversion trigger:
  *         independent or from ADC group regular.
  * @rmtoll CR1      JAUTO          LL_ADC_INJ_GetTrigAuto
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_INJ_TRIG_INDEPENDENT
  *         @arg @ref LL_ADC_INJ_TRIG_FROM_GRP_REGULAR
  */
__STATIC_INLINE uint32_t LL_ADC_INJ_GetTrigAuto(ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CR1, ADC_CR1_JAUTO));
}

/**
  * @brief  Set ADC group injected offset.
  * @note   It sets:
  *         - ADC group injected rank to which the offset programmed
  *           will be applied
  *         - Offset level (offset to be subtracted from the raw
  *           converted data).
  *         Caution: Offset format is dependent to ADC resolution:
  *         offset has to be left-aligned on bit 11, the LSB (right bits)
  *         are set to 0.
  * @note   Offset cannot be enabled or disabled.
  *         To emulate offset disabled, set an offset value equal to 0.
  * @rmtoll JOFR1    JOFFSET1       LL_ADC_INJ_SetOffset\n
  *         JOFR2    JOFFSET2       LL_ADC_INJ_SetOffset\n
  *         JOFR3    JOFFSET3       LL_ADC_INJ_SetOffset\n
  *         JOFR4    JOFFSET4       LL_ADC_INJ_SetOffset
  * @param  ADCx ADC instance
  * @param  Rank This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @param  OffsetLevel Value between Min_Data=0x000 and Max_Data=0xFFF
  * @retval None
  */
__STATIC_INLINE void LL_ADC_INJ_SetOffset(ADC_TypeDef *ADCx, uint32_t Rank, uint32_t OffsetLevel)
{
  register uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->JOFR1, __ADC_MASK_SHIFT(Rank, ADC_INJ_JOFRX_REGOFFSET_MASK));
  
  MODIFY_REG(*preg,
             ADC_JOFR1_JOFFSET1,
             OffsetLevel);
}

/**
  * @brief  Get ADC group injected offset.
  * @note   It gives offset level (offset to be subtracted from the raw converted data).
  *         Caution: Offset format is dependent to ADC resolution:
  *         offset has to be left-aligned on bit 11, the LSB (right bits)
  *         are set to 0.
  * @rmtoll JOFR1    JOFFSET1       LL_ADC_INJ_GetOffset\n
  *         JOFR2    JOFFSET2       LL_ADC_INJ_GetOffset\n
  *         JOFR3    JOFFSET3       LL_ADC_INJ_GetOffset\n
  *         JOFR4    JOFFSET4       LL_ADC_INJ_GetOffset
  * @param  ADCx ADC instance
  * @param  Rank This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @retval Value between Min_Data=0x000 and Max_Data=0xFFF
  */
__STATIC_INLINE uint32_t LL_ADC_INJ_GetOffset(ADC_TypeDef *ADCx, uint32_t Rank)
{
  register uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->JOFR1, __ADC_MASK_SHIFT(Rank, ADC_INJ_JOFRX_REGOFFSET_MASK));
  
  return (uint32_t)(READ_BIT(*preg,
                             ADC_JOFR1_JOFFSET1)
                   );
}

/**
  * @}
  */

/** @defgroup ADC_LL_EF_Configuration_Channels Configuration of ADC hierarchical scope: channels
  * @{
  */

/**
  * @brief  Set sampling time of the selected ADC channel
  *         Unit: ADC clock cycles.
  * @note   On this device, sampling time is on channel scope: independently
  *         of channel mapped on ADC group regular or injected.
  * @note   In case of internal channel (VrefInt, TempSensor, ...) to be
  *         converted:
  *         sampling time constraints must be respected (sampling time can be
  *         adjusted in function of ADC clock frequency and sampling time
  *         setting).
  *         Refer to device datasheet for timings values (parameters TS_vrefint,
  *         TS_temp, ...).
  * @note   Conversion time is the addition of sampling time and processing time.
  *         Refer to reference manual for ADC processing time of
  *         this STM32 serie.
  * @note   In case of ADC conversion of internal channel (VrefInt,
  *         temperature sensor, ...), a sampling time minimum value
  *         is required.
  *         Refer to device datasheet.
  * @rmtoll SMPR0    SMP31          LL_ADC_SetChannelSamplingTime\n
  *         SMPR0    SMP30          LL_ADC_SetChannelSamplingTime\n
  *         SMPR1    SMP29          LL_ADC_SetChannelSamplingTime\n
  *         SMPR1    SMP28          LL_ADC_SetChannelSamplingTime\n
  *         SMPR1    SMP27          LL_ADC_SetChannelSamplingTime\n
  *         SMPR1    SMP26          LL_ADC_SetChannelSamplingTime\n
  *         SMPR1    SMP25          LL_ADC_SetChannelSamplingTime\n
  *         SMPR1    SMP24          LL_ADC_SetChannelSamplingTime\n
  *         SMPR1    SMP23          LL_ADC_SetChannelSamplingTime\n
  *         SMPR1    SMP22          LL_ADC_SetChannelSamplingTime\n
  *         SMPR1    SMP21          LL_ADC_SetChannelSamplingTime\n
  *         SMPR1    SMP20          LL_ADC_SetChannelSamplingTime\n
  *         SMPR2    SMP19          LL_ADC_SetChannelSamplingTime\n
  *         SMPR2    SMP18          LL_ADC_SetChannelSamplingTime\n
  *         SMPR2    SMP17          LL_ADC_SetChannelSamplingTime\n
  *         SMPR2    SMP16          LL_ADC_SetChannelSamplingTime\n
  *         SMPR2    SMP15          LL_ADC_SetChannelSamplingTime\n
  *         SMPR2    SMP14          LL_ADC_SetChannelSamplingTime\n
  *         SMPR2    SMP13          LL_ADC_SetChannelSamplingTime\n
  *         SMPR2    SMP12          LL_ADC_SetChannelSamplingTime\n
  *         SMPR2    SMP11          LL_ADC_SetChannelSamplingTime\n
  *         SMPR2    SMP10          LL_ADC_SetChannelSamplingTime\n
  *         SMPR3    SMP9           LL_ADC_SetChannelSamplingTime\n
  *         SMPR3    SMP8           LL_ADC_SetChannelSamplingTime\n
  *         SMPR3    SMP7           LL_ADC_SetChannelSamplingTime\n
  *         SMPR3    SMP6           LL_ADC_SetChannelSamplingTime\n
  *         SMPR3    SMP5           LL_ADC_SetChannelSamplingTime\n
  *         SMPR3    SMP4           LL_ADC_SetChannelSamplingTime\n
  *         SMPR3    SMP3           LL_ADC_SetChannelSamplingTime\n
  *         SMPR3    SMP2           LL_ADC_SetChannelSamplingTime\n
  *         SMPR3    SMP1           LL_ADC_SetChannelSamplingTime\n
  *         SMPR3    SMP0           LL_ADC_SetChannelSamplingTime
  * @param  ADCx ADC instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0          (2)
  *         @arg @ref LL_ADC_CHANNEL_1          (2)
  *         @arg @ref LL_ADC_CHANNEL_2          (2)
  *         @arg @ref LL_ADC_CHANNEL_3          (2)
  *         @arg @ref LL_ADC_CHANNEL_4          (1)
  *         @arg @ref LL_ADC_CHANNEL_5          (1)
  *         @arg @ref LL_ADC_CHANNEL_6          (2)
  *         @arg @ref LL_ADC_CHANNEL_7          (2)
  *         @arg @ref LL_ADC_CHANNEL_8          (2)
  *         @arg @ref LL_ADC_CHANNEL_9          (2)
  *         @arg @ref LL_ADC_CHANNEL_10         (2)
  *         @arg @ref LL_ADC_CHANNEL_11         (2)
  *         @arg @ref LL_ADC_CHANNEL_12         (2)
  *         @arg @ref LL_ADC_CHANNEL_13         (3)
  *         @arg @ref LL_ADC_CHANNEL_14         (3)
  *         @arg @ref LL_ADC_CHANNEL_15         (3)
  *         @arg @ref LL_ADC_CHANNEL_16         (3)
  *         @arg @ref LL_ADC_CHANNEL_17         (3)
  *         @arg @ref LL_ADC_CHANNEL_18         (3)
  *         @arg @ref LL_ADC_CHANNEL_19         (3)
  *         @arg @ref LL_ADC_CHANNEL_20         (3)
  *         @arg @ref LL_ADC_CHANNEL_21         (3)
  *         @arg @ref LL_ADC_CHANNEL_22         (1)
  *         @arg @ref LL_ADC_CHANNEL_23         (1)
  *         @arg @ref LL_ADC_CHANNEL_24         (1)
  *         @arg @ref LL_ADC_CHANNEL_25         (1)
  *         @arg @ref LL_ADC_CHANNEL_26         (3)
  *         @arg @ref LL_ADC_CHANNEL_27         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_28         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_29         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_30         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_31         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT    (3)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR (3)
  *         @arg @ref LL_ADC_CHANNEL_VCOMP      (3)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP1    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3    (3)(5)
  *         
  *         (1) On STM32L1, connection via routing interface (RI) specificity: fast channel (channel routed directly to ADC switch matrix).\n
  *         (2) On STM32L1, for devices with feature 'channels banks' available: Channel different in bank A and bank B.\n
  *         (3) On STM32L1, for devices with feature 'channels banks' available: Channel common to both bank A and bank B.\n
  *         (4) On STM32L1, parameter not available on all devices: only on STM32L1 Cat.4 and Cat.5.\n
  *         (5) On STM32L1, parameter not available on all devices: OPAMP1 and OPAMP2 available only on STM32L1 Cat.3, Cat.4 and Cat.5, OPAMP3 available only on STM32L1 Cat.4 and Cat.5
  * @param  SamplingTime This parameter can be one of the following values:
  *         @arg @ref LL_ADC_SAMPLINGTIME_4CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_9CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_16CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_24CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_48CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_96CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_192CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_384CYCLES
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetChannelSamplingTime(ADC_TypeDef *ADCx, uint32_t Channel, uint32_t SamplingTime)
{
  /* Set bits with content of parameter "SamplingTime" with bits position     */
  /* in register and register position depending on parameter "Channel".      */
  /* Parameter "Channel" is used with masks because containing                */
  /* other bits reserved for other purpose.                                   */
  register uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->SMPR1, __ADC_MASK_SHIFT(Channel, ADC_CHANNEL_SMPRX_REGOFFSET_MASK));
  
  MODIFY_REG(*preg,
             ADC_SMPR3_SMP0 << __ADC_MASK_SHIFT(Channel, ADC_CHANNEL_SMPx_BITOFFSET_MASK),
             SamplingTime   << __ADC_MASK_SHIFT(Channel, ADC_CHANNEL_SMPx_BITOFFSET_MASK));
}

