zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32l1xx/drivers/include/stm32l1xx_ll_adc.h
/**
  * @brief  Get sampling time of the selected ADC channel
  *         Unit: ADC clock cycles.
  * @note   On this device, sampling time is on channel scope: independently
  *         of channel mapped on ADC group regular or injected.
  * @note   Conversion time is the addition of sampling time and processing time.
  *         Refer to reference manual for ADC processing time of
  *         this STM32 serie.
  * @rmtoll SMPR0    SMP31          LL_ADC_GetChannelSamplingTime\n
  *         SMPR0    SMP30          LL_ADC_GetChannelSamplingTime\n
  *         SMPR1    SMP29          LL_ADC_GetChannelSamplingTime\n
  *         SMPR1    SMP28          LL_ADC_GetChannelSamplingTime\n
  *         SMPR1    SMP27          LL_ADC_GetChannelSamplingTime\n
  *         SMPR1    SMP26          LL_ADC_GetChannelSamplingTime\n
  *         SMPR1    SMP25          LL_ADC_GetChannelSamplingTime\n
  *         SMPR1    SMP24          LL_ADC_GetChannelSamplingTime\n
  *         SMPR1    SMP23          LL_ADC_GetChannelSamplingTime\n
  *         SMPR1    SMP22          LL_ADC_GetChannelSamplingTime\n
  *         SMPR1    SMP21          LL_ADC_GetChannelSamplingTime\n
  *         SMPR1    SMP20          LL_ADC_GetChannelSamplingTime\n
  *         SMPR2    SMP19          LL_ADC_GetChannelSamplingTime\n
  *         SMPR2    SMP18          LL_ADC_GetChannelSamplingTime\n
  *         SMPR2    SMP17          LL_ADC_GetChannelSamplingTime\n
  *         SMPR2    SMP16          LL_ADC_GetChannelSamplingTime\n
  *         SMPR2    SMP15          LL_ADC_GetChannelSamplingTime\n
  *         SMPR2    SMP14          LL_ADC_GetChannelSamplingTime\n
  *         SMPR2    SMP13          LL_ADC_GetChannelSamplingTime\n
  *         SMPR2    SMP12          LL_ADC_GetChannelSamplingTime\n
  *         SMPR2    SMP11          LL_ADC_GetChannelSamplingTime\n
  *         SMPR2    SMP10          LL_ADC_GetChannelSamplingTime\n
  *         SMPR3    SMP9           LL_ADC_GetChannelSamplingTime\n
  *         SMPR3    SMP8           LL_ADC_GetChannelSamplingTime\n
  *         SMPR3    SMP7           LL_ADC_GetChannelSamplingTime\n
  *         SMPR3    SMP6           LL_ADC_GetChannelSamplingTime\n
  *         SMPR3    SMP5           LL_ADC_GetChannelSamplingTime\n
  *         SMPR3    SMP4           LL_ADC_GetChannelSamplingTime\n
  *         SMPR3    SMP3           LL_ADC_GetChannelSamplingTime\n
  *         SMPR3    SMP2           LL_ADC_GetChannelSamplingTime\n
  *         SMPR3    SMP1           LL_ADC_GetChannelSamplingTime\n
  *         SMPR3    SMP0           LL_ADC_GetChannelSamplingTime
  * @param  ADCx ADC instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0          (2)
  *         @arg @ref LL_ADC_CHANNEL_1          (2)
  *         @arg @ref LL_ADC_CHANNEL_2          (2)
  *         @arg @ref LL_ADC_CHANNEL_3          (2)
  *         @arg @ref LL_ADC_CHANNEL_4          (1)
  *         @arg @ref LL_ADC_CHANNEL_5          (1)
  *         @arg @ref LL_ADC_CHANNEL_6          (2)
  *         @arg @ref LL_ADC_CHANNEL_7          (2)
  *         @arg @ref LL_ADC_CHANNEL_8          (2)
  *         @arg @ref LL_ADC_CHANNEL_9          (2)
  *         @arg @ref LL_ADC_CHANNEL_10         (2)
  *         @arg @ref LL_ADC_CHANNEL_11         (2)
  *         @arg @ref LL_ADC_CHANNEL_12         (2)
  *         @arg @ref LL_ADC_CHANNEL_13         (3)
  *         @arg @ref LL_ADC_CHANNEL_14         (3)
  *         @arg @ref LL_ADC_CHANNEL_15         (3)
  *         @arg @ref LL_ADC_CHANNEL_16         (3)
  *         @arg @ref LL_ADC_CHANNEL_17         (3)
  *         @arg @ref LL_ADC_CHANNEL_18         (3)
  *         @arg @ref LL_ADC_CHANNEL_19         (3)
  *         @arg @ref LL_ADC_CHANNEL_20         (3)
  *         @arg @ref LL_ADC_CHANNEL_21         (3)
  *         @arg @ref LL_ADC_CHANNEL_22         (1)
  *         @arg @ref LL_ADC_CHANNEL_23         (1)
  *         @arg @ref LL_ADC_CHANNEL_24         (1)
  *         @arg @ref LL_ADC_CHANNEL_25         (1)
  *         @arg @ref LL_ADC_CHANNEL_26         (3)
  *         @arg @ref LL_ADC_CHANNEL_27         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_28         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_29         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_30         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_31         (3)(4)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT    (3)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR (3)
  *         @arg @ref LL_ADC_CHANNEL_VCOMP      (3)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP1    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3    (3)(5)
  *         
  *         (1) On STM32L1, connection via routing interface (RI) specificity: fast channel (channel routed directly to ADC switch matrix).\n
  *         (2) On STM32L1, for devices with feature 'channels banks' available: Channel different in bank A and bank B.\n
  *         (3) On STM32L1, for devices with feature 'channels banks' available: Channel common to both bank A and bank B.\n
  *         (4) On STM32L1, parameter not available on all devices: only on STM32L1 Cat.4 and Cat.5.\n
  *         (5) On STM32L1, parameter not available on all devices: OPAMP1 and OPAMP2 available only on STM32L1 Cat.3, Cat.4 and Cat.5, OPAMP3 available only on STM32L1 Cat.4 and Cat.5
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_SAMPLINGTIME_4CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_9CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_16CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_24CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_48CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_96CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_192CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_384CYCLES
  */
__STATIC_INLINE uint32_t LL_ADC_GetChannelSamplingTime(ADC_TypeDef *ADCx, uint32_t Channel)
{
  register uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->SMPR1, __ADC_MASK_SHIFT(Channel, ADC_CHANNEL_SMPRX_REGOFFSET_MASK));
  
  return (uint32_t)(READ_BIT(*preg,
                             ADC_SMPR3_SMP0 << __ADC_MASK_SHIFT(Channel, ADC_CHANNEL_SMPx_BITOFFSET_MASK))
                    >> __ADC_MASK_SHIFT(Channel, ADC_CHANNEL_SMPx_BITOFFSET_MASK)
                   );
}

#if defined(COMP_CSR_FCH3)
/**
  * @brief  Set ADC channels routing.
  * @note   Channel routing set configuration between ADC IP and GPIO pads,
  *         it is used to increase ADC channels speed (setting of
  *         direct channel).
  * @note   This feature is specific to STM32L1, on devices
  *         category Cat.3, Cat.4, Cat.5.
  *         To use this function, COMP RCC clock domain must be enabled.
  *         Refer to @ref LL_APB1_GRP1_PERIPH_COMP.
  * @rmtoll CSR      FCH3           LL_ADC_SetChannelRouting
  * @rmtoll CSR      FCH8           LL_ADC_SetChannelRouting
  * @rmtoll CSR      RCH13          LL_ADC_SetChannelRouting
  * @param  ADCx ADC instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_3_ROUTING  (1)
  *         @arg @ref LL_ADC_CHANNEL_8_ROUTING  (2)
  *         @arg @ref LL_ADC_CHANNEL_13_ROUTING (3)
  *
  *         (1) Used as ADC direct channel (fast channel) if OPAMP1 is
  *             in power down mode.\n
  *         (2) Used as ADC direct channel (fast channel) if OPAMP2 is
  *             in power down mode.\n
  *         (3) Used as ADC re-routed channel if OPAMP3 is
  *             in power down mode.
  *             Otherwise, channel 13 is connected to OPAMP3 output and routed
  *             through switches COMP1_SW1 and VCOMP to ADC switch matrix.
  *             (Note: OPAMP3 is available on STM32L1 Cat.4 only).
  * @param  Routing This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_ROUTING_DEFAULT
  *         @arg @ref LL_ADC_CHANNEL_ROUTING_DIRECT
  */
__STATIC_INLINE void LL_ADC_SetChannelRouting(ADC_TypeDef *ADCx, uint32_t Channel, uint32_t Routing)
{
  /* Note: Bit is located in comparator IP, but dedicated to ADC */
  MODIFY_REG(COMP->CSR, Channel, (Routing << POSITION_VAL(Channel)));
}

/**
  * @brief  Get ADC channels speed.
  * @note   Channel routing set configuration between ADC IP and GPIO pads,
  *         it is used to increase ADC channels speed (setting of
  *         direct channel).
  * @note   This feature is specific to STM32L1, on devices
  *         category Cat.3, Cat.4, Cat.5.
  *         To use this function, COMP RCC clock domain must be enabled.
  *         Refer to @ref LL_APB1_GRP1_PERIPH_COMP.
  * @rmtoll CSR      FCH3           LL_ADC_GetChannelRouting
  * @rmtoll CSR      FCH8           LL_ADC_GetChannelRouting
  * @rmtoll CSR      RCH13          LL_ADC_GetChannelRouting
  * @param  ADCx ADC instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_3_ROUTING  (1)
  *         @arg @ref LL_ADC_CHANNEL_8_ROUTING  (2)
  *         @arg @ref LL_ADC_CHANNEL_13_ROUTING (3)
  *
  *         (1) Used as ADC direct channel (fast channel) if OPAMP1 is
  *             in power down mode.\n
  *         (2) Used as ADC direct channel (fast channel) if OPAMP2 is
  *             in power down mode.\n
  *         (3) Used as ADC re-routed channel if OPAMP3 is
  *             in power down mode.
  *             Otherwise, channel 13 is connected to OPAMP3 output and routed
  *             through switches COMP1_SW1 and VCOMP to ADC switch matrix.
  *             (Note: OPAMP3 is available on STM32L1 Cat.4 only).
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_ROUTING_DEFAULT
  *         @arg @ref LL_ADC_CHANNEL_ROUTING_DIRECT
  */
__STATIC_INLINE uint32_t LL_ADC_GetChannelRouting(ADC_TypeDef *ADCx, uint32_t Channel)
{
  /* Note: Bit is located in comparator IP, but dedicated to ADC */
  return (uint32_t)(READ_BIT(COMP->CSR, Channel) >> POSITION_VAL(Channel));
}
#endif

/**
  * @}
  */

/** @defgroup ADC_LL_EF_Configuration_ADC_AnalogWatchdog Configuration of ADC transversal scope: analog watchdog
  * @{
  */

/**
  * @brief  Set ADC analog watchdog monitored channels:
  *         a single channel or all channels,
  *         on ADC groups regular and-or injected.
  * @note   Once monitored channels are selected, analog watchdog
  *         is enabled.
  * @note   In case of need to define a single channel to monitor
  *         with analog watchdog from sequencer channel definition,
  *         use helper macro @ref __LL_ADC_ANALOGWD_CHANNEL_GROUP().
  * @note   On this STM32 serie, there is only 1 kind of analog watchdog
  *         instance:
  *         - AWD standard (instance AWD1):
  *           - channels monitored: can monitor 1 channel or all channels.
  *           - groups monitored: ADC groups regular and-or injected.
  *           - resolution: resolution is not limited (corresponds to
  *             ADC resolution configured).
  * @rmtoll CR1      AWD1CH         LL_ADC_SetAnalogWDMonitChannels\n
  *         CR1      AWD1SGL        LL_ADC_SetAnalogWDMonitChannels\n
  *         CR1      AWD1EN         LL_ADC_SetAnalogWDMonitChannels
  * @param  ADCx ADC instance
  * @param  AWDChannelGroup This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_DISABLE
  *         @arg @ref LL_ADC_AWD_ALL_CHANNELS_REG
  *         @arg @ref LL_ADC_AWD_ALL_CHANNELS_INJ
  *         @arg @ref LL_ADC_AWD_ALL_CHANNELS_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_0_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_0_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_0_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_1_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_1_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_1_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_2_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_2_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_2_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_3_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_3_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_3_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_4_REG           (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_4_INJ           (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_4_REG_INJ       (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_5_REG           (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_5_INJ           (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_5_REG_INJ       (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_6_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_6_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_6_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_7_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_7_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_7_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_8_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_8_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_8_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_9_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_9_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_9_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_10_REG          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_10_INJ          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_10_REG_INJ      (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_11_REG          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_11_INJ          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_11_REG_INJ      (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_12_REG          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_12_INJ          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_12_REG_INJ      (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_13_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_13_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_13_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_14_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_14_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_14_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_15_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_15_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_15_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_16_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_16_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_16_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_17_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_17_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_17_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_18_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_18_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_18_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_19_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_19_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_19_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_20_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_20_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_20_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_21_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_21_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_21_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_22_REG          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_22_INJ          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_22_REG_INJ      (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_23_REG          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_23_INJ          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_23_REG_INJ      (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_24_REG          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_24_INJ          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_24_REG_INJ      (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_25_REG          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_25_INJ          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_25_REG_INJ      (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_26_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_26_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_26_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_27_REG          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_27_INJ          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_27_REG_INJ      (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_28_REG          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_28_INJ          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_28_REG_INJ      (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_29_REG          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_29_INJ          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_29_REG_INJ      (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_30_REG          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_30_INJ          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_30_REG_INJ      (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_31_REG          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_31_INJ          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_31_REG_INJ      (3)(4)
  *         @arg @ref LL_ADC_AWD_CH_VREFINT_REG          (3)
  *         @arg @ref LL_ADC_AWD_CH_VREFINT_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CH_VREFINT_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CH_TEMPSENSOR_REG       (3)
  *         @arg @ref LL_ADC_AWD_CH_TEMPSENSOR_INJ       (3)
  *         @arg @ref LL_ADC_AWD_CH_TEMPSENSOR_REG_INJ   (3)
  *         @arg @ref LL_ADC_AWD_CH_VCOMP_REG            (3)
  *         @arg @ref LL_ADC_AWD_CH_VCOMP_INJ            (3)
  *         @arg @ref LL_ADC_AWD_CH_VCOMP_REG_INJ        (3)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP1_REG          (3)(5)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP1_INJ          (3)(5)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP1_REG_INJ      (3)(5)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP2_REG          (3)(5)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP2_INJ          (3)(5)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP2_REG_INJ      (3)(5)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP3_REG          (3)(5)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP3_INJ          (3)(5)
  *         @arg @ref LL_ADC_AWD_CH_VOPAMP3_REG_INJ      (3)(5)
  *         
  *         (1) On STM32L1, connection via routing interface (RI) specificity: fast channel (channel routed directly to ADC switch matrix).\n
  *         (2) On STM32L1, for devices with feature 'channels banks' available: Channel different in bank A and bank B.\n
  *         (3) On STM32L1, for devices with feature 'channels banks' available: Channel common to both bank A and bank B.\n
  *         (4) On STM32L1, parameter not available on all devices: only on STM32L1 Cat.4 and Cat.5.\n
  *         (5) On STM32L1, parameter not available on all devices: OPAMP1 and OPAMP2 available only on STM32L1 Cat.3, Cat.4 and Cat.5, OPAMP3 available only on STM32L1 Cat.4 and Cat.5
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetAnalogWDMonitChannels(ADC_TypeDef *ADCx, uint32_t AWDChannelGroup)
{
  MODIFY_REG(ADCx->CR1,
             (ADC_CR1_AWDEN | ADC_CR1_JAWDEN | ADC_CR1_AWDSGL | ADC_CR1_AWDCH),
             AWDChannelGroup);
}

