zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32l1xx/drivers/include/stm32l1xx_ll_adc.h
/**
  * @brief  Get ADC analog watchdog monitored channel.
  * @note   Usage of the returned channel number:
  *         - To reinject this channel into another function LL_ADC_xxx:
  *           the returned channel number is only partly formatted on definition
  *           of literals LL_ADC_CHANNEL_x. Therefore, it has to be compared
  *           with parts of literals LL_ADC_CHANNEL_x or using
  *           helper macro @ref __LL_ADC_CHANNEL_TO_DECIMAL_NB().
  *           Then the selected literal LL_ADC_CHANNEL_x can be used
  *           as parameter for another function.
  *         - To get the channel number in decimal format:
  *           process the returned value with the helper macro
  *           @ref __LL_ADC_CHANNEL_TO_DECIMAL_NB().
  *           Applicable only when the analog watchdog is set to monitor
  *           one channel.
  * @note   On this STM32 serie, there is only 1 kind of analog watchdog
  *         instance:
  *         - AWD standard (instance AWD1):
  *           - channels monitored: can monitor 1 channel or all channels.
  *           - groups monitored: ADC groups regular and-or injected.
  *           - resolution: resolution is not limited (corresponds to
  *             ADC resolution configured).
  * @rmtoll CR1      AWD1CH         LL_ADC_GetAnalogWDMonitChannels\n
  *         CR1      AWD1SGL        LL_ADC_GetAnalogWDMonitChannels\n
  *         CR1      AWD1EN         LL_ADC_GetAnalogWDMonitChannels
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_AWD_DISABLE
  *         @arg @ref LL_ADC_AWD_ALL_CHANNELS_REG
  *         @arg @ref LL_ADC_AWD_ALL_CHANNELS_INJ
  *         @arg @ref LL_ADC_AWD_ALL_CHANNELS_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_0_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_0_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_0_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_1_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_1_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_1_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_2_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_2_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_2_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_3_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_3_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_3_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_4_REG           (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_4_INJ           (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_4_REG_INJ       (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_5_REG           (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_5_INJ           (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_5_REG_INJ       (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_6_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_6_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_6_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_7_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_7_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_7_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_8_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_8_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_8_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_9_REG           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_9_INJ           (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_9_REG_INJ       (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_10_REG          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_10_INJ          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_10_REG_INJ      (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_11_REG          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_11_INJ          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_11_REG_INJ      (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_12_REG          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_12_INJ          (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_12_REG_INJ      (2)
  *         @arg @ref LL_ADC_AWD_CHANNEL_13_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_13_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_13_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_14_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_14_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_14_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_15_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_15_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_15_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_16_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_16_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_16_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_17_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_17_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_17_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_18_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_18_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_18_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_19_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_19_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_19_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_20_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_20_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_20_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_21_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_21_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_21_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_22_REG          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_22_INJ          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_22_REG_INJ      (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_23_REG          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_23_INJ          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_23_REG_INJ      (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_24_REG          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_24_INJ          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_24_REG_INJ      (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_25_REG          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_25_INJ          (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_25_REG_INJ      (1)
  *         @arg @ref LL_ADC_AWD_CHANNEL_26_REG          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_26_INJ          (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_26_REG_INJ      (3)
  *         @arg @ref LL_ADC_AWD_CHANNEL_27_REG          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_27_INJ          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_27_REG_INJ      (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_28_REG          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_28_INJ          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_28_REG_INJ      (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_29_REG          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_29_INJ          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_29_REG_INJ      (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_30_REG          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_30_INJ          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_30_REG_INJ      (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_31_REG          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_31_INJ          (3)(4)
  *         @arg @ref LL_ADC_AWD_CHANNEL_31_REG_INJ      (3)(4)
  *         
  *         (1) On STM32L1, connection via routing interface (RI) specificity: fast channel (channel routed directly to ADC switch matrix).\n
  *         (2) On STM32L1, for devices with feature 'channels banks' available: Channel different in bank A and bank B.\n
  *         (3) On STM32L1, for devices with feature 'channels banks' available: Channel common to both bank A and bank B.\n
  *         (4) On STM32L1, parameter not available on all devices: only on STM32L1 Cat.4 and Cat.5.
  */
__STATIC_INLINE uint32_t LL_ADC_GetAnalogWDMonitChannels(ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CR1, (ADC_CR1_AWDEN | ADC_CR1_JAWDEN | ADC_CR1_AWDSGL | ADC_CR1_AWDCH)));
}

/**
  * @brief  Set ADC analog watchdog threshold value of threshold
  *         high or low.
  * @note   In case of ADC resolution different of 12 bits,
  *         analog watchdog thresholds data require a specific shift.
  *         Use helper macro @ref __LL_ADC_ANALOGWD_SET_THRESHOLD_RESOLUTION().
  * @note   On this STM32 serie, there is only 1 kind of analog watchdog
  *         instance:
  *         - AWD standard (instance AWD1):
  *           - channels monitored: can monitor 1 channel or all channels.
  *           - groups monitored: ADC groups regular and-or injected.
  *           - resolution: resolution is not limited (corresponds to
  *             ADC resolution configured).
  * @rmtoll HTR      HT             LL_ADC_SetAnalogWDThresholds\n
  *         LTR      LT             LL_ADC_SetAnalogWDThresholds
  * @param  ADCx ADC instance
  * @param  AWDThresholdsHighLow This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_THRESHOLD_HIGH
  *         @arg @ref LL_ADC_AWD_THRESHOLD_LOW
  * @param  AWDThresholdValue: Value between Min_Data=0x000 and Max_Data=0xFFF
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetAnalogWDThresholds(ADC_TypeDef *ADCx, uint32_t AWDThresholdsHighLow, uint32_t AWDThresholdValue)
{
  register uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->HTR, AWDThresholdsHighLow);
  
  MODIFY_REG(*preg,
             ADC_HTR_HT,
             AWDThresholdValue);
}

/**
  * @brief  Get ADC analog watchdog threshold value of threshold high or
  *         threshold low.
  * @note   In case of ADC resolution different of 12 bits,
  *         analog watchdog thresholds data require a specific shift.
  *         Use helper macro @ref __LL_ADC_ANALOGWD_GET_THRESHOLD_RESOLUTION().
  * @rmtoll HTR      HT             LL_ADC_GetAnalogWDThresholds\n
  *         LTR      LT             LL_ADC_GetAnalogWDThresholds
  * @param  ADCx ADC instance
  * @param  AWDThresholdsHighLow This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_THRESHOLD_HIGH
  *         @arg @ref LL_ADC_AWD_THRESHOLD_LOW
  * @retval Value between Min_Data=0x000 and Max_Data=0xFFF
*/
__STATIC_INLINE uint32_t LL_ADC_GetAnalogWDThresholds(ADC_TypeDef *ADCx, uint32_t AWDThresholdsHighLow)
{
  register uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->HTR, AWDThresholdsHighLow);
  
  return (uint32_t)(READ_BIT(*preg, ADC_HTR_HT));
}

/**
  * @}
  */

/** @defgroup ADC_LL_EF_Operation_ADC_Instance Operation on ADC hierarchical scope: ADC instance
  * @{
  */

/**
  * @brief  Enable the selected ADC instance.
  * @note   On this STM32 serie, after ADC enable, a delay for 
  *         ADC internal analog stabilization is required before performing a
  *         ADC conversion start.
  *         Refer to device datasheet, parameter tSTAB.
  * @note   Due to the latency introduced by the synchronization between
  *         two clock domains (ADC clock source asynchronous),
  *         some hardware constraints must be respected:
  *         - ADC must be enabled (@ref LL_ADC_Enable() ) only
  *           when ADC is not ready to convert.
  *         - ADC must be disabled (@ref LL_ADC_Disable() ) only
  *           when ADC is ready to convert.
  *         Status of ADC ready to convert can be checked using function
  *         @ref LL_ADC_IsActiveFlag_ADRDY().
  * @rmtoll CR2      ADON           LL_ADC_Enable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_Enable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CR2, ADC_CR2_ADON);
}

/**
  * @brief  Disable the selected ADC instance.
  * @note   Due to the latency introduced by the synchronization between
  *         two clock domains (ADC clock source asynchronous),
  *         some hardware constraints must be respected:
  *         - ADC must be enabled (@ref LL_ADC_Enable() ) only
  *           when ADC is not ready to convert.
  *         - ADC must be disabled (@ref LL_ADC_Disable() ) only
  *           when ADC is ready to convert.
  *         Status of ADC ready to convert can be checked using function
  *         @ref LL_ADC_IsActiveFlag_ADRDY().
  * @rmtoll CR2      ADON           LL_ADC_Disable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_Disable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->CR2, ADC_CR2_ADON);
}

/**
  * @brief  Get the selected ADC instance enable state.
  * @rmtoll CR2      ADON           LL_ADC_IsEnabled
  * @param  ADCx ADC instance
  * @retval 0: ADC is disabled, 1: ADC is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabled(ADC_TypeDef *ADCx)
{
  return (READ_BIT(ADCx->CR2, ADC_CR2_ADON) == (ADC_CR2_ADON));
}

/**
  * @}
  */

